docs/blog/2025-01-22-cpp-signal-handler.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ signal dispatcher</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
<header><a href="./">Home</a>
</header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">C++ signal dispatcher</h1>
<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">main.cpp</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;iostream&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;thread&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;csignal&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">"sig.hpp"</span>

<span style="font-weight: bold;">auto</span> <span style="font-weight: bold;">handler</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">signum</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">void</span> {
    <span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"SIGALRM\n"</span>;
}

<span style="font-weight: bold;">auto</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">void</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">int</span> {
  <span style="font-weight: bold; text-decoration: underline;">bool</span> <span style="font-weight: bold; font-style: italic;">stop</span> = <span style="font-weight: bold; text-decoration: underline;">false</span>;
  <span style="font-weight: bold; text-decoration: underline;">sig_handler</span>::setHandler(SIGINT, [&amp;<span style="font-weight: bold; font-style: italic;">stop</span>] (<span style="font-weight: bold; text-decoration: underline;">int</span>) { stop = <span style="font-weight: bold; text-decoration: underline;">true</span>; });
  <span style="font-weight: bold; text-decoration: underline;">sig_handler</span>::setHandler(SIGALRM, &amp;handler);

  <span style="font-weight: bold;">while</span> (!stop) {
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">this_thread</span>::sleep_for(<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">chrono</span>::seconds(1));
    raise(SIGALRM);
  }
  <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="font-style: italic;">"Bye"</span> &lt;&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::endl;
  <span style="font-weight: bold;">return</span> 0;
}

</pre>
</div>


<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">sig.cpp</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;cstring&gt;</span> <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">strsignal</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;csignal&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;string&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdexcept&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;unordered_map&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;mutex&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">"sig.hpp"</span>

<span style="font-weight: bold;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">sig_handler</span> {

  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">timed_mutex</span> <span style="font-weight: bold; font-style: italic;">signalHandlersMutex</span>;
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">unordered_map</span>&lt;<span style="font-weight: bold; text-decoration: underline;">int</span>, <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">function</span>&lt;<span style="font-weight: bold; text-decoration: underline;">void</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>)&gt;&gt; <span style="font-weight: bold; font-style: italic;">signalHandlers</span>;

  <span style="font-weight: bold;">auto</span> <span style="font-weight: bold;">dispatcher</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">signal</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">void</span> {
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">unique_lock</span>&lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">timed_mutex</span>&gt; <span style="font-weight: bold; font-style: italic;">lock</span>(signalHandlersMutex, <span style="font-weight: bold; text-decoration: underline;">std</span>::defer_lock);
    <span style="font-weight: bold;">if</span> (!lock.try_lock_for(<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">chrono</span>::seconds(1))) {
      <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">unable to get the lock. should be a strange case</span>
      <span style="font-weight: bold;">return</span>;
    }
    <span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">it</span> = signalHandlers.find(signal);
    <span style="font-weight: bold;">if</span> (it != signalHandlers.end()) {
      it-&gt;second(signal);
    }
  }

  <span style="font-weight: bold;">auto</span> <span style="font-weight: bold;">registerHandler</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">signal</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">function</span>&lt;<span style="font-weight: bold; text-decoration: underline;">void</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>)&gt;&amp; <span style="font-weight: bold; font-style: italic;">handler</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">void</span> {
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">lock_guard</span>&lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">timed_mutex</span>&gt; <span style="font-weight: bold; font-style: italic;">lock</span>(signalHandlersMutex);
    signalHandlers.emplace(signal, handler);
  }


  <span style="font-weight: bold;">auto</span> <span style="font-weight: bold;">setHandler</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">signal</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">function</span>&lt;<span style="font-weight: bold; text-decoration: underline;">void</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>)&gt;&amp; <span style="font-weight: bold; font-style: italic;">handler</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">flags</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">void</span> {

    <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">sigaction</span> <span style="font-weight: bold; font-style: italic;">action</span>;
    <span style="font-weight: bold;">if</span> (sigfillset(&amp;action.sa_mask) == -1) {
      <span style="font-weight: bold;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::runtime_error(<span style="font-style: italic;">"sigfillset failed"</span>);
    }
    action.sa_flags = flags;
    action.sa_handler = dispatcher;

    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">set handler for the signal</span>
    <span style="font-weight: bold;">if</span> (sigaction(signal, &amp;action, <span style="font-weight: bold; text-decoration: underline;">nullptr</span>) == -1 &amp;&amp; signal &lt; __SIGRTMIN) {
      <span style="font-weight: bold;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::runtime_error(<span style="font-style: italic;">"Fail at configuring handler for signal: "</span> + <span style="font-weight: bold; text-decoration: underline;">std</span>::string(strsignal(signal)));
    }
    registerHandler(signal, handler);
  }

}

</pre>
</div>


<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">sig.hpp</span>
<span style="font-weight: bold;">#if</span><span style="font-weight: bold;">n</span><span style="font-weight: bold;">def</span> SIG_HPP
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">SIG_HPP</span>

<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;functional&gt;</span>

<span style="font-weight: bold;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">sig_handler</span> {

        <span style="font-weight: bold;">auto</span> <span style="font-weight: bold;">setHandler</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">signal</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">function</span>&lt;<span style="font-weight: bold; text-decoration: underline;">void</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>)&gt;&amp; <span style="font-weight: bold; font-style: italic;">handler</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">flags</span>=0) -&gt; <span style="font-weight: bold; text-decoration: underline;">void</span>;

}

<span style="font-weight: bold;">#endif</span>


</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-01-22</p>
</div>
</body>
</html>
